#### Terraform Plan for development
---
#### Terraform Format and Style 🖌`skipped`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.node_id: Refreshing state... [id=3Rg]
aws_iam_role.vpc-fl: Refreshing state... [id=cashewhands-vpc-fl]
aws_security_group.webserver_sg: Refreshing state... [id=sg-05f49d53b4daf680a]
aws_s3_bucket_versioning.vpc-fl-bucket: Refreshing state... [id=cashewhands-flogs-s3-bucket]
aws_flow_log.vpc-fl: Refreshing state... [id=fl-097e889adf8ad8575]
aws_iam_role_policy.vpc-fl: Refreshing state... [id=cashewhands-vpc-fl:flow-log-policy]
aws_vpc.vpc: Refreshing state... [id=vpc-07193208af8312cf9]
aws_s3_bucket_public_access_block.vpc-fl-bucket: Refreshing state... [id=cashewhands-flogs-s3-bucket]
aws_s3_bucket.vpc-fl-bucket: Refreshing state... [id=cashewhands-flogs-s3-bucket]
aws_s3_bucket_server_side_encryption_configuration.example: Refreshing state... [id=cashewhands-flogs-s3-bucket]
data.aws_ami.server_ami: Reading...
data.aws_ami.server_ami: Read complete after 1s [id=ami-01d08089481510ba2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_flow_log.vpc-fl will be destroyed
  # (because aws_flow_log.vpc-fl is not in configuration)
  - resource "aws_flow_log" "vpc-fl" {
      - arn                      = "arn:aws:ec2:us-east-1:012119841372:vpc-flow-log/fl-097e889adf8ad8575" -> null
      - id                       = "fl-097e889adf8ad8575" -> null
      - log_destination          = "arn:aws:s3:::cashewhands-flogs-s3-bucket" -> null
      - log_destination_type     = "s3" -> null
      - log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> null
      - max_aggregation_interval = 600 -> null
      - tags                     = {} -> null
      - tags_all                 = {
          - "Backup"        = "false"
          - "Environment"   = "development"
          - "Product-Owner" = "cashewhands"
          - "Project"       = "terraform-masterclass"
          - "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          - "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          - "Team"          = "cashewhands"
          - "Terraform"     = "true"
        } -> null
      - traffic_type             = "ALL" -> null
      - vpc_id                   = "vpc-07193208af8312cf9" -> null

      - destination_options {
          - file_format                = "plain-text" -> null
          - hive_compatible_partitions = false -> null
          - per_hour_partition         = false -> null
        }
    }

  # aws_iam_role.vpc-fl will be destroyed
  # (because aws_iam_role.vpc-fl is not in configuration)
  - resource "aws_iam_role" "vpc-fl" {
      - arn                   = "arn:aws:iam::012119841372:role/cashewhands-vpc-fl" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "vpc-flow-logs.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-11-03T20:24:50Z" -> null
      - force_detach_policies = false -> null
      - id                    = "cashewhands-vpc-fl" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "cashewhands-vpc-fl" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Backup"        = "false"
          - "Environment"   = "development"
          - "Product-Owner" = "cashewhands"
          - "Project"       = "terraform-masterclass"
          - "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          - "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          - "Team"          = "cashewhands"
          - "Terraform"     = "true"
        } -> null
      - unique_id             = "AROAQFUTGDJOKEYN6MNF4" -> null

      - inline_policy {
          - name   = "flow-log-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                              - "logs:DescribeLogGroups",
                              - "logs:DescribeLogStreams",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.vpc-fl will be destroyed
  # (because aws_iam_role_policy.vpc-fl is not in configuration)
  - resource "aws_iam_role_policy" "vpc-fl" {
      - id     = "cashewhands-vpc-fl:flow-log-policy" -> null
      - name   = "flow-log-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogGroups",
                          - "logs:DescribeLogStreams",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "cashewhands-vpc-fl" -> null
    }

  # aws_instance.webserver will be created
  + resource "aws_instance" "webserver" {
      + ami                                  = "ami-01d08089481510ba2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "cashewhands"
          + "Project"       = "terraform-masterclass"
          + "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          + "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          + "Team"          = "cashewhands"
          + "Terraform"     = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "34bab59199daf5245dcd538c46b61435fff39fe8"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-05f49d53b4daf680a",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_s3_bucket.vpc-fl-bucket will be destroyed
  # (because aws_s3_bucket.vpc-fl-bucket is not in configuration)
  - resource "aws_s3_bucket" "vpc-fl-bucket" {
      - arn                         = "arn:aws:s3:::cashewhands-flogs-s3-bucket" -> null
      - bucket                      = "cashewhands-flogs-s3-bucket" -> null
      - bucket_domain_name          = "cashewhands-flogs-s3-bucket.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "cashewhands-flogs-s3-bucket.s3.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "cashewhands-flogs-s3-bucket" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Id        = "AWSLogDeliveryWrite20150319"
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - ArnLike      = {
                              - "aws:SourceArn" = "arn:aws:logs:us-east-1:012119841372:*"
                            }
                          - StringEquals = {
                              - "aws:SourceAccount" = "012119841372"
                              - "s3:x-amz-acl"      = "bucket-owner-full-control"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "delivery.logs.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::cashewhands-flogs-s3-bucket/AWSLogs/012119841372/*"
                      - Sid       = "AWSLogDeliveryWrite"
                    },
                  - {
                      - Action    = "s3:GetBucketAcl"
                      - Condition = {
                          - ArnLike      = {
                              - "aws:SourceArn" = "arn:aws:logs:us-east-1:012119841372:*"
                            }
                          - StringEquals = {
                              - "aws:SourceAccount" = "012119841372"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "delivery.logs.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::cashewhands-flogs-s3-bucket"
                      - Sid       = "AWSLogDeliveryAclCheck"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "Backup"        = "false"
          - "Environment"   = "development"
          - "Product-Owner" = "cashewhands"
          - "Project"       = "terraform-masterclass"
          - "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          - "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          - "Team"          = "cashewhands"
          - "Terraform"     = "true"
        } -> null

      - grant {
          - id          = "fc42cee51a82ce8b7ba3f49f6718adca8096771ec5af606e92d51374e3a46bb2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_public_access_block.vpc-fl-bucket will be destroyed
  # (because aws_s3_bucket_public_access_block.vpc-fl-bucket is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "vpc-fl-bucket" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "cashewhands-flogs-s3-bucket" -> null
      - id                      = "cashewhands-flogs-s3-bucket" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_server_side_encryption_configuration.example will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.example is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "example" {
      - bucket = "cashewhands-flogs-s3-bucket" -> null
      - id     = "cashewhands-flogs-s3-bucket" -> null

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }

  # aws_s3_bucket_versioning.vpc-fl-bucket will be destroyed
  # (because aws_s3_bucket_versioning.vpc-fl-bucket is not in configuration)
  - resource "aws_s3_bucket_versioning" "vpc-fl-bucket" {
      - bucket = "cashewhands-flogs-s3-bucket" -> null
      - id     = "cashewhands-flogs-s3-bucket" -> null

      - versioning_configuration {
          - status = "Enabled" -> null
        }
    }

  # aws_vpc.vpc will be destroyed
  # (because aws_vpc.vpc is not in configuration)
  - resource "aws_vpc" "vpc" {
      - arn                                  = "arn:aws:ec2:us-east-1:012119841372:vpc/vpc-07193208af8312cf9" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.20.0.0/16" -> null
      - default_network_acl_id               = "acl-060186e1716b90d74" -> null
      - default_route_table_id               = "rtb-01257b1410bf06547" -> null
      - default_security_group_id            = "sg-03f6c242b40a8ccbd" -> null
      - dhcp_options_id                      = "dopt-0746b9de053134adb" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-07193208af8312cf9" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-01257b1410bf06547" -> null
      - owner_id                             = "012119841372" -> null
      - tags                                 = {} -> null
      - tags_all                             = {
          - "Backup"        = "false"
          - "Environment"   = "development"
          - "Product-Owner" = "cashewhands"
          - "Project"       = "terraform-masterclass"
          - "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          - "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          - "Team"          = "cashewhands"
          - "Terraform"     = "true"
        } -> null
    }

Plan: 1 to add, 0 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @cashewhands, Action: `pull_request`*